Tekla Open API Reference for Tekla Structures 2025
GridSurface.IsManual Property
 Gets or sets if the line was manually created.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsManual { get; }
Public ReadOnly Property IsManual As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GridSurface Class
Tekla.Structures.Model Namespace